{
    "name": "Barton Creek Greenbelt",
    "parklocation": [30.2527, -97.8148],
    "description": "park description",
    "numberoftrails": 5,
    "hiking": true,
    "cycling": true,
    "locationid":1,
    "trails": [ {
        "name": "Upper Barton Creek Greenbelt",
        "img": "https://i.imgur.com/bww5jun.jpg",
        "summary": "Once you park off of Scottish Woods Trail Road and Camp Craft Road, you'll see the trailhead right at the top of Camp Craft Road. You'll immediately begin descending \"The Hill of Life\" section of the hike which covers three-hundred vertical feet in just over a third of a mile, and includes numerous obstacles, including loose rocks, limestone ledges and concrete erosion-block steps (up to a foot in height), plus plenty of roots and ruts. Once you have descended to the creek area, the hike is pretty straightforward as it winds around toward Barton Creek Falls and the sculptured rocks area for a nice rest/swim if you wish. This hike is definitely not for people who want a lazy day of hiking. Come ready for a workout and to enjoy working hard for your hiking experience.",
        "length":  5,
        "trailhead": [30.2527, -97.8148],
        "elevationascent": 299, 
        "elevationdescent": -299,
        "averagegrade": 2,
        "maxgrade":  27,
        "dogs": true,
        "cost": 0,
        "gpx": "https://www.hikingproject.com/trail/gpx/7036455",
        "id": 1
        },{"name": "Lower Barton Creek Greenbelt",
        "img": "https://i.imgur.com/ByVakd1.jpg",
        "summary": "For this trip you'll park just off the Spyglass Drive and Barton Skyway crossing. You'll see the trailhead for the Barton Creek Greenbelt Access Trail just across the street from Taco Deli (which, by the way, is a great locals taco stand!). Along the greenbelt, there are a ton of nice spots to rest and even try some basic rock climbing if that's your interest. The highlight of this route is at the halfway turn-around point where you arrive at the Barton Creek Falls and sculptured rocks area. This one of the most popular locals spots around in the summer or whenever the water is up. The hike itself is pretty straightforward, and this route allows you to access the Barton Creek Falls without having to deal with the heavy traffic and often over-crowded upper trails near the falls themselves... this is the experts back way into the falls! As with most trails and hikes around Austin, this is a very dog friendly/fun route.",
        "length": 7.8,
        "trailhead": [30.2527, -97.8148],
        "elevationascent": 167, 
        "elevationdescent": -167,
        "averagegrade": 1,
        "maxgrade":  4,
        "dogs": true,
        "id": 2
        },{"name": "Barton Creek Greenbelt Trail",
        "img": "https://i.imgur.com/wZCyPfw.jpg",
        "summary": "This trail can be accessed from many points. If you're hiking it in its entirety, a shuttle might be best. On a hot summer day, you might want to do the hike in reverse, dropping you off at the famous Barton Springs for a nice cool splash! When starting this hike from Zilker Park, the trail is wide and flat, covered with your typical Texas crushed granite. This section is ideal for anyone with limited mobility or families with strollers. As the trail continues, you'll pass large overhanging limestone where you can watch rock climbers playing in the beautiful greenbelt. This hike crosses the creek many times. Depending on the rainfall, there is almost always a way around these creek crossings. If it's a dry year, you can expect to hike right along the creek bed. For swimming holes and waterfalls, the first one to cross will be Campbell's Hole around the 0.8-mile marker. The next one, Twin Falls is just past the Mopac Bridge around the 4.8-mile marker. Just over a mile past Twin Falls, you'll find Sculptor Falls. Even though these are the most popular spots to swim with a view, many people will take a dip anywhere along the creek.",
        "length": 3.4,
        "trailhead": [30.2527, -97.8148],
        "elevationascent": 304, 
        "elevationdescent": -20,
        "averagegrade": 2,
        "maxgrade":  28,
        "dogs": true,
        "id": 3
        },{"name": "Violet Crown Trail",
        "img": "https://i.imgur.com/0mzXywY.jpg",
        "summary": "The first six-mile segment of the Violet Crown Trail is now open and is on its way to becoming the longest trail of its kind in Central Texas. Once complete, the 30-mile trail will provide a unique recreational experience as it passes through the urban wildlands of the Barton Creek Wilderness Park, the City of Sunset Valley, and eventually into Hays County. Along its route, the trail will connect scenic natural areas to neighborhoods, shopping centers, a library, and public parks. Passing near the Lady Bird Johnson Wildflower Center, the Violet Crown Trail will head south, winding through the rolling countryside of the City of Austin's Water Quality Protection Lands in a uniquely natural setting. The Violet Crown Trail represents the greater vision of Hill Country Conservancy's work to get people out on the land. Users will have the opportunity to experience conservation lands like never before – surrounded by wildlife, clean streams, and the breathtaking views of land preserved by HCC and its partners.",
        "length": 5.4,
        "trailhead": [30.2527, -97.8148],
        "elevationascent": 149, 
        "elevationdescent": -387,
        "averagegrade": 2,
        "maxgrade":  10,
        "dogs": true,
        "id": 4
        },{"name": "Eagles Landing",
        "img": "https://i.imgur.com/eKULStI.jpg",
        "summary": "This trail is part of the larger Barton Creek Greenbelt. On a map, you would see it on the opposite side of the water from the official Barton Creek Trail. The neighborhood inlet that leads to this trail is off of Southwest Parkway and Mopac. This trail wraps around a 715 foot high hill. There are not many views on the trail when there isn't water, but getting up to the top of the hill that the trail surrounds provides some nice views of parts of the greenbelt. The view is about a 3 out of 5. The best part of this connector-type trail is that it links to the greenbelt river and allows a quick and easy loop with established trail markings from the Eagles Landing/Hilltop neighborhood to the south. It's easy to stay on the trail, but watch out for the many connectors that might take you on a longer hike than you wanted. I would recommend bringing a hiking stick or some trekking poles. Some parts of the trail quickly drop in elevation, and the ridges against the side of the 750 foot elevated hill that this trail wraps around can be a tad bit treacherous. Other than that, this hike is a piece of cake since two-thirds of the trail is relatively flat. It's also nice that you'll be in the shade for three-quarters of the trail even in the heat of the sun since there's a nice canopy that covers most of it. There is a south connector that extends the length of the entire Barton Creek Greenbelt on the south side of the river. Be careful not to take it or you're in for an extra 5 mile hike. The fork you'll see will be clearly established.",
        "length": 1.2,
        "trailhead": [30.2527, -97.8148],
        "elevationascent": 142, 
        "elevationdescent": -139,
        "averagegrade": 4,
        "maxgrade":  27,
        "dogs": true,
        "id": 5
            }
    ]

  }

  